[
    {
        "id": "rfqiovnasdovnasofiaov",
        "chef_picture": "https://images.unsplash.com/photo-1581299894007-aaa50297cf16?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MTF8fGNoZWZ8ZW58MHx8MHx8&auto=format&fit=crop&w=600&q=60",
        "chef_name": "John Smith",
        "bio": "John Smith is a passionate chef with a flair for creating unique and innovative dishes. With over 15 years of experience in the culinary industry, John has honed his skills and developed a deep understanding of various cooking techniques. His recipes reflect his commitment to using fresh, locally sourced ingredients to create unforgettable dining experiences. John's creations have earned him a dedicated following and numerous accolades from food enthusiasts around the world.",
        "years_of_experience": 10,
        "num_of_recipes": 50,
        "likes": 1000
    },
    {
        "id": "jonadjvnaeoahwefnoe",
        "chef_picture": "https://plus.unsplash.com/premium_photo-1661778091956-15dbe6e47442?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MTN8fGNoZWZ8ZW58MHx8MHx8&w=1000&q=80",
        "chef_name": "Sarah Johnson",
        "bio": "Sarah Johnson is a talented chef known for her mastery of traditional cuisines from different cultures. With a culinary career spanning over a decade, Sarah has traveled extensively, exploring diverse culinary traditions and learning from local chefs. Her passion for blending flavors and her meticulous attention to detail are evident in her recipes. Sarah's creations are a harmonious fusion of time-honored techniques and modern interpretations, making her a favorite among food enthusiasts.",
        "years_of_experience": 8,
        "num_of_recipes": 75,
        "likes": 1500
    },
    {
        "id": "fjifnwifeufnapieq",
        "chef_picture": "https://images.unsplash.com/photo-1562514155-444b9a967dfa?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxjb2xsZWN0aW9uLXBhZ2V8NHxVY1BwTkhGWW9hVXx8ZW58MHx8fHw%3D&auto=format&fit=crop&w=600&q=60",
        "chef_name": "Michael Thompson",
        "bio": "Michael Thompson is a renowned chef known for his innovative approach to contemporary cuisine. With over 20 years of experience in the culinary world, Michael has worked in Michelin-starred restaurants and has been recognized for his culinary expertise. His recipes push the boundaries of flavor combinations and presentation, resulting in visually stunning and mouthwatering dishes. Michael's culinary creations have gained him a loyal following and made him a sought-after chef in the industry.",
        "likes": 12000,
        "years_of_experience": 15,
        "num_of_recipes": 100
    },
    {
        "id": "fjfqneruheurnfqir",
        "chef_picture": "https://images.unsplash.com/photo-1659354213732-8cdec0a6fb47?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1000&q=80",
        "chef_name": "Emily Davis",
        "bio": "Emily Davis is a talented pastry chef with a passion for creating delightful desserts. With 10 years of experience in the pastry industry, Emily has mastered the art of combining flavors, textures, and artistic elements to craft visually stunning and delicious treats. Her love for pastry extends beyond traditional recipes, as she constantly experiments with new ingredients and techniques to push the boundaries of dessert creations. Emily's desserts have garnered praise from both critics and dessert enthusiasts alike.",
        "years_of_experience": 5,
        "num_of_recipes": 40,
        "likes": 800
    },
    {
        "id": "fniqer0fqherfuiqerno",
        "chef_picture": "https://images.unsplash.com/photo-1622021142947-da7dedc7c39a?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MTh8fGNoZWZ8ZW58MHx8MHx8&auto=format&fit=crop&w=600&q=60",
        "chef_name": "Daniel Wilson",
        "bio": "Daniel Wilson is a passionate chef with a focus on sustainable and farm-to-table cooking. With 8 years of experience, Daniel has developed a deep appreciation for locally sourced ingredients and a commitment to promoting eco-friendly practices in the culinary world. His recipes emphasize the natural flavors of seasonal produce and highlight the importance of supporting local farmers. Daniel's culinary creations are a celebration of simplicity and sustainability, making him a chef admired by both food lovers and environmentalists.",
        "years_of_experience": 12,
        "num_of_recipes": 60,
        "likes": 1200
    },
    {
        "id": "fjgerughe0u8rhq8u8",
        "chef_picture": "https://media.istockphoto.com/id/1394055240/photo/happy-black-female-chef-preparing-food-in-frying-pan-at-restaurant-kitchen.jpg?b=1&s=170667a&w=0&k=20&c=8pARCDQkmc8X6SUnWQBY7MAdYVBSxbH8PBS3sJxLOiE=",
        "chef_name": "Olivia Martinez",
        "bio": "Olivia Martinez is a culinary prodigy with a passion for experimental and avant-garde cooking. Despite her young age, Olivia has quickly made a name for herself in the culinary world with her bold flavors and innovative techniques. Her unique approach to ingredients and presentation challenges traditional notions of what a dish can be. Olivia's recipes are a feast for the senses, pushing boundaries and delighting adventurous food enthusiasts. With a growing following and a reputation for culinary innovation, Olivia continues to inspire and amaze with her gastronomic creations.",
        "years_of_experience": 7,
        "num_of_recipes": 90,
        "likes": 1800
    }
]